{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_cased_preprocess/3"}, "name": "keras_layer", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_1", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_cased_L-12_H-768_A-12/4"}, "name": "keras_layer_1", "inbound_nodes": [{"input_mask": ["keras_layer", 0, 0, {}], "input_word_ids": ["keras_layer", 0, 2, {}], "input_type_ids": ["keras_layer", 0, 1, {}]}]}, {"class_name": "Dense", "config": {"name": "inter1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inter1", "inbound_nodes": [[["keras_layer_1", 0, 13, {}]]]}, {"class_name": "Dense", "config": {"name": "inter2", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inter2", "inbound_nodes": [[["inter1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "V", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "V", "inbound_nodes": [[["inter2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "A", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "A", "inbound_nodes": [[["inter2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "D", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "D", "inbound_nodes": [[["inter2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["V", 0, 0], ["A", 0, 0], ["D", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}